{
    "Posts": [
        {
            "id": "1",
            "date": "1/14/2020",
            "title": "Them Ducks are a'runnin!",
            "content": "Exactly 1000 ducks ran through the park today causing havoc. Please take a moment to read these duck facts to better inform and protect yourself from future rampages: Duck is the common name for numerous species in the waterfowl family Anatidae which also includes swans and geese. Ducks are divided among several subfamilies in the family Anatidae; they do not represent a monophyletic group the group of all descendants of a single common ancestral species but a form taxon, since swans and geese are not considered ducks. Ducks are mostly aquatic birds, mostly smaller than the swans and geese, and may be found in both fresh water and sea water. Ducks are sometimes confused with several types of unrelated water birds with similar forms, such as loons or divers, grebes, gallinules and coots.",
            "imageLink": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Bucephala-albeola-010.jpg"
        },
        {
            "id": "2",
            "date": "4/04/2010",
            "title": "Watch out for beavers!",
            "content": "Exactly 1 beaver ran through the park today causing havoc. Please take a moment to read these beaver facts to better inform and protect yourself from future rampages: The beaver (genus Castor) is a large, primarily nocturnal, semiaquatic rodent. Castor includes two extant species, the North American beaver (Castor canadensis) (native to North America) and Eurasian beaver (Castor fiber) (Eurasia).[1] Beavers are known for building dams, canals, and lodges (homes). They are the second-largest rodent in the world (after the capybara). Their colonies create one or more dams to provide still, deep water to protect against predators, and to float food and building material. The North American beaver population was once more than 60 million, but as of 1988 was 6–12 million. This population decline is the result of extensive hunting for fur, for glands used as medicine and perfume, and because the beavers' harvesting of trees and flooding of waterways may interfere with other land uses.", 
            "imageLink": "https://upload.wikimedia.org/wikipedia/commons/6/6b/American_Beaver.jpg"
        },
        {
            "id": "3",
            "date": "1/10/1998",
            "title": "Be careful of geese!",
            "content": "A small herd of geese waddled through the park today causing havoc. Please take a moment to read these geese facts to better inform and protect yourself from future rampages: A goose is a bird of any of several waterfowl species in the family Anatidae. This group comprises the genera Anser (the grey geese), Branta (the black geese), and Chen (which includes the white geese); the latter being commonly placed within the genus Anser. Some other birds, mostly related to the shelducks, have goose as part of their names. More distantly related members of the family Anatidae are swans, most of which are larger than true geese, and ducks, which are smaller. The term goose is more properly used for a female bird, while gander refers specifically to a male one. Young birds before fledging are called goslings.[1] The collective noun for a group of geese on the ground is a gaggle; when in flight, they are called a skein, a team, or a wedge; when flying close together, they are called a plump.",
            "imageLink": "https://upload.wikimedia.org/wikipedia/commons/3/34/Anser_anser_1_%28Piotr_Kuczynski%29.jpg"
        }
    ]
}
